In [1]:
import pandas as pd

In [2]:
l = [1,2,3,4,2,5,6]

In [3]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    2
5    5
6    6
dtype: int64

In [4]:
l2 = {'one': 1, 2:'two', 'three': 3, 'four': 4}

In [5]:
pd.Series(l2)

one        1
2        two
three      3
four       4
dtype: object

In [6]:
data = [
    [1000, 'steve', 87.93],
    [1001, 'joy', 90],
    [1002, 'sujoy', 94.45],
    [1003, 'jason', 60.45],
    [1004, 'sanju', 73.56]
]

In [7]:
df = pd.DataFrame(data, columns=['Regd. No', 'Name', 'Marks%'])

In [8]:
df

   Regd. No   Name  Marks%
0      1000  steve   87.93
1      1001    joy   90.00
2      1002  sujoy   94.45
3      1003  jason   60.45
4      1004  sanju   73.56

In [9]:
df = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/Standard_Metropolitan_Areas_Data-data.csv")

In [10]:
df

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
0,1384,78.1,12.3,25627,69678,50.1,4083.9,72100,1,75.55
1,3719,43.9,9.4,13326,43292,53.9,3305.9,54542,2,56.03
2,3553,37.4,10.7,9724,33731,50.6,2066.3,33216,1,41.32
3,3916,29.9,8.8,6402,24167,52.2,1966.7,32906,2,67.38
4,2480,31.5,10.5,8502,16751,66.1,1514.5,26573,4,80.19
...,...,...,...,...,...,...,...,...,...,...
94,1511,38.7,10.7,348,1093,50.4,127.2,1452,4,70.66
95,1543,39.6,8.1,159,481,30.3,80.6,769,3,36.36
96,1011,37.8,10.5,264,964,70.7,93.2,1337,3,60.16
97,813,13.4,10.9,371,4355,58.0,97.0,1589,1,36.33
98,654,28.8,3.9,140,1296,55.1,66.9,1148,3,68.76

In [11]:
exam_scores = pd.read_csv('https://raw.githubusercontent.com/dphi-official/Datasets/master/exam_scores.csv')

In [12]:
df.shape

(99, 10)

In [13]:
exam_scores

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71
...,...,...,...,...,...,...,...,...
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [14]:
exam_scores.shape

(1000, 8)

In [15]:
exam_scores.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [16]:
exam_scores.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [17]:
exam_scores.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [18]:
exam_scores.info() # summary about the df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [19]:
sma_data = pd.read_csv('https://raw.githubusercontent.com/dphi-official/Datasets/master/Standard_Metropolitan_Areas_Data-data.csv')

In [20]:
sma_data.shape

(99, 10)

In [21]:
sma_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       99 non-null     int64
 1   percent_city    99 non-null     float64
 2   percent_senior  99 non-null     float64
 3   physicians      99 non-null     int64
 4   hospital_beds   99 non-null     int64
 5   graduates       99 non-null     float64
 6   work_force      99 non-null     float64
 7   income          99 non-null     int64
 8   region          99 non-null     int64
 9   crime_rate      99 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 7.9 KB

In [22]:
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [23]:
exam_scores.iloc[0,0]

'male'

In [24]:
exam_scores.iloc[0:4,0:4]

   gender race/ethnicity parental level of education         lunch
0    male        group B           bachelor's degree      standard
1  female        group C                some college      standard
2    male        group C                some college  free/reduced
3  female        group D           bachelor's degree  free/reduced

In [25]:
exam_scores.iloc[0:5,4]

0         none
1    completed
2         none
3         none
4         none
Name: test preparation course, dtype: object

In [26]:
exam_scores.iloc[[0,1,2,3,4],3]

0        standard
1        standard
2    free/reduced
3    free/reduced
4        standard
Name: lunch, dtype: object

In [27]:
exam_scores.iloc[[0,1,2,3,4],2]

0    bachelor's degree
1         some college
2         some college
3    bachelor's degree
4         some college
Name: parental level of education, dtype: object

In [28]:
exam_scores.iloc[-5:, -2:]

     reading score  writing score
995             77             72
996             81             94
997             67             67
998             68             70
999             57             50

In [29]:
exam_scores.iloc[-8:, 2:]

,parental level of education,lunch,test preparation course,math score,reading score,writing score
992,bachelor's degree,standard,none,78,73,71
993,some college,standard,none,56,54,45
994,master's degree,standard,completed,85,93,90
995,some high school,standard,none,68,77,72
996,some college,standard,none,98,81,94
997,associate's degree,free/reduced,none,67,67,67
998,high school,standard,none,63,68,70
999,some college,free/reduced,none,49,57,50

In [30]:
exam_scores.loc[0, 'race/ethnicity']

'group B'

In [31]:
exam_scores.loc[0:5, ['gender', 'lunch', 'math score']]

   gender         lunch  math score
0    male      standard          74
1  female      standard          58
2    male  free/reduced          66
3  female  free/reduced          74
4    male      standard          78
5  female      standard          75

In [32]:
exam_scores.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [33]:
exam_scores['math score']

0      74
1      58
2      66
3      74
4      78
       ..
995    68
996    98
997    67
998    63
999    49
Name: math score, Length: 1000, dtype: int64

In [34]:
exam_scores['test preparation course']

0           none
1      completed
2           none
3           none
4           none
         ...
995         none
996         none
997         none
998         none
999         none
Name: test preparation course, Length: 1000, dtype: object

In [35]:
exam_scores[['math score', 'writing score']]

     math score  writing score
0            74             67
1            58             66
2            66             65
3            74             73
4            78             71
..          ...            ...
995          68             72
996          98             94
997          67             67
998          63             70
999          49             50

[1000 rows x 2 columns]

In [36]:
exam_scores.describe()

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [37]:
exam_scores.info

<bound method DataFrame.info of      gender race/ethnicity parental level of education         lunch  \
0      male        group B           bachelor's degree      standard
1    female        group C                some college      standard
2      male        group C                some college  free/reduced
3    female        group D           bachelor's degree  free/reduced
4      male        group D                some college      standard
..      ...            ...                         ...           ...
995  female        group C            some high school      standard
996  female        group E                some college      standard
997  female        group E          associate's degree  free/reduced
998  female        group C                 high school      standard
999    male        group C                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          74             68             67
1                 completed          58             68             66
2                      none          66             65             65
3                      none          74             75             73
4                      none          78             77             71
..                      ...         ...            ...            ...
995                    none          68             77             72
996                    none          98             81             94
997                    none          67             67             67
998                    none          63             68             70
999                    none          49             57             50

[1000 rows x 8 columns]>

In [38]:
exam_scores['gender'].value_counts()

female    502
male      498
Name: gender, dtype: int64

In [39]:
gender_data = exam_scores['gender'].value_counts()

In [40]:
type(exam_scores['gender'].value_counts())

pandas.core.series.Series

In [41]:
gender_data['male']

498

In [42]:
gender_data['female']

502

In [43]:
sma_data.head(11)

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
0,1384,78.1,12.3,25627,69678,50.1,4083.9,72100,1,75.55
1,3719,43.9,9.4,13326,43292,53.9,3305.9,54542,2,56.03
2,3553,37.4,10.7,9724,33731,50.6,2066.3,33216,1,41.32
3,3916,29.9,8.8,6402,24167,52.2,1966.7,32906,2,67.38
4,2480,31.5,10.5,8502,16751,66.1,1514.5,26573,4,80.19
5,2815,23.1,6.7,7340,16941,68.3,1541.9,25663,3,58.48
6,8360,46.3,8.2,4047,14347,53.6,1321.2,18350,3,72.25
7,6794,60.1,6.3,4562,14333,51.7,1272.7,18221,3,64.88
8,3049,19.5,12.1,4005,21149,53.4,967.5,15826,1,30.51
9,4647,31.5,9.2,3916,12815,65.1,1032.2,14542,2,55.30
10,1008,16.6,10.3,4006,16704,55.9,935.5,15953,1,54.16

In [44]:
sma_data.loc[10:10,['crime_rate']]

    crime_rate
10       54.16

In [45]:
sma_data.loc[9:9,['crime_rate']]

   crime_rate
9        55.3

In [46]:
sma_data['physicians'].tail()

94    348
95    159
96    264
97    371
98    140
Name: physicians, dtype: int64

In [47]:
sma_data.loc[-1:, ['physicians']]

    physicians
0        25627
1        13326
2         9724
3         6402
4         8502
..         ...
94         348
95         159
96         264
97         371
98         140

[99 rows x 1 columns]

In [48]:
sma_data.iloc[-1:,3]

98    140
Name: physicians, dtype: int64

In [49]:
sample_data = sma_data.loc[[1,3,5,7,9,13], ['land_area', 'work_force', 'income', 'region', 'crime_rate']]

In [50]:
sample_data

    land_area  work_force  income  region  crime_rate
1        3719      3305.9   54542       2       56.03
3        3916      1966.7   32906       2       67.38
5        2815      1541.9   25663       3       58.48
7        6794      1272.7   18221       3       64.88
9        4647      1032.2   14542       2       55.30
13        782       915.2   12591       4       63.20

In [51]:
sam_data = sma_data['region'].value_counts()
sam_data

3    36
2    25
1    21
4    17
Name: region, dtype: int64

In [52]:
sam_data[2]

25

In [53]:
exam_scores.describe()    #  summary of numerical columns

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [54]:
exam_scores.describe(include='object')      #  summary is all about the categorical columns.

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,502,294,226,649,654

In [55]:
exam_scores.describe(include='all')  # a summary of numerical and categorical columns together

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

-  A categorical column cannot have minimum or maximum values or mean and median. So the entries in these fields for categorical columns are NaN

- count shows the number of non-null values/ entries in a particular column
- unique shows the count of unique values in a particular column
- top is also for categorical columns. tells us which category is occurring maximum time like female in gender column
- freq is again for categorical columns: gives the number of occurrences of the top category in that column
- mean: the mean value of the numerical column
- std: standard deviation of the numerical column. tells you about the variation in the data
- min: the minimum value in the numerical column
- 25% the 25th percentile or 1st quartile value in the numerical column, eg math score is 58
- 50% the 50th percentile value in the numerical column, median math score is 67
- 75% the 75 percentile value in the numerical column,  75th percentile value for math is 78
- max: the maximum value of a numerical column
- NaN: Nan values means that a particular summary value is not available. eg, gender a categorical column doesn't have mean or median value

In [56]:
exam_scores['math score'].describe()

count    1000.000000
mean       67.128000
std        14.815367
min        15.000000
25%        58.000000
50%        67.000000
75%        78.000000
max       100.000000
Name: math score, dtype: float64

In [57]:
exam_scores.mean()              # for numerical columns

C:\Users\jason\AppData\Local\Temp\ipykernel_2392\668518713.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  exam_scores.mean()              # for numerical columns

math score       67.128
reading score    70.174
writing score    68.973
dtype: float64

In [58]:
exam_scores.gender.unique()        # returns all the unique values in a dataset

array(['male', 'female'], dtype=object)

In [59]:
exam_scores.gender.value_counts()            # 'female' is occurring 502

female    502
male      498
Name: gender, dtype: int64

In [60]:
sma_data.mean()

land_area         2615.727273
percent_city        42.518182
percent_senior       9.781818
physicians        1828.333333
hospital_beds     6345.868687
graduates           54.463636
work_force         449.366667
income            6762.505051
region               2.494949
crime_rate          55.643030
dtype: float64

In [61]:
sma_data.region.unique()

array([1, 2, 4, 3], dtype=int64)

In [62]:
sma_data.describe()

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
mean,2615.727273,42.518182,9.781818,1828.333333,6345.868687,54.463636,449.366667,6762.505051,2.494949,55.643030
std,3045.826210,17.348277,2.524547,3192.199763,9136.202716,7.773286,610.990885,10393.349660,1.013921,13.470943
min,47.000000,13.400000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,1.000000,23.320000
25%,1408.000000,30.100000,8.350000,459.000000,2390.000000,50.250000,150.300000,2003.000000,2.000000,46.115000
50%,1951.000000,39.500000,9.700000,774.000000,3472.000000,54.000000,257.200000,3510.000000,3.000000,56.060000
75%,2890.500000,52.600000,10.750000,1911.500000,6386.500000,58.300000,436.500000,6283.500000,3.000000,63.860000
max,27293.000000,100.000000,21.800000,25627.000000,69678.000000,72.800000,4083.900000,72100.000000,4.000000,85.620000

In [63]:
sma_data['region'].value_counts()

3    36
2    25
1    21
4    17
Name: region, dtype: int64

In [64]:
sma_data_region =  sma_data[sma_data['region'] == 3]

In [65]:
sma_data_region.mean()

land_area         2485.972222
percent_city        46.172222
percent_senior       9.283333
physicians        1313.722222
hospital_beds     4962.777778
graduates           51.002778
work_force         343.797222
income            4806.861111
region               3.000000
crime_rate          58.265556
dtype: float64

In [66]:
sma_data_region.describe()

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.0,36.000000
mean,2485.972222,46.172222,9.283333,1313.722222,4962.777778,51.002778,343.797222,4806.861111,3.0,58.265556
std,1653.813800,19.101019,3.458199,1459.654903,3879.692625,7.328164,354.312228,5452.647656,0.0,10.155822
min,654.000000,14.500000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,3.0,36.360000
25%,1517.000000,31.350000,7.600000,509.750000,2483.500000,46.950000,146.200000,1940.750000,3.0,52.447500
50%,2018.000000,47.000000,8.850000,767.000000,3876.000000,50.950000,230.550000,2976.500000,3.0,58.725000
75%,2911.000000,59.725000,9.975000,1583.500000,5811.750000,55.175000,366.950000,4829.500000,3.0,64.922500
max,8360.000000,90.700000,21.800000,7340.000000,16941.000000,70.700000,1541.900000,25663.000000,3.0,76.350000

In [67]:
exam_scores.sort_values(by='math score', ascending=False).head()     # sorting the column on the basis of math result

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
91,male,group D,associate's degree,standard,none,100,94,96
776,male,group E,associate's degree,standard,completed,100,100,100
588,male,group D,some college,standard,completed,100,85,91
128,male,group A,associate's degree,standard,completed,100,97,94
565,male,group E,bachelor's degree,standard,completed,100,100,100

In [68]:
exam_scores.sort_values(by='math score').head()  # on the basis of the lowest scores obtained

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
949,male,group C,high school,free/reduced,none,15,18,10
854,male,group C,high school,free/reduced,none,18,30,18
891,female,group C,high school,free/reduced,none,23,31,27
349,male,group B,some high school,free/reduced,none,25,31,30
739,female,group E,some high school,free/reduced,none,25,35,38

In [69]:
exam_scores['math score'].sort_values()[:8]

C:\Users\jason\AppData\Local\Temp\ipykernel_2392\1227249992.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  exam_scores['math score'].sort_values()[:8]

949    15
854    18
891    23
349    25
739    25
316    28
310    30
413    31
Name: math score, dtype: int64

In [70]:
exam_scores['math score'].iloc[:7]

0    74
1    58
2    66
3    74
4    78
5    75
6    69
Name: math score, dtype: int64

In [71]:
exam_scores.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [72]:
exam_scores.rename(columns={'race/ethnicity': 'race',
                            'parental level of education': 'parental_education_level',
                            'test preparation course': 'test_prep_course',
                            'math score': 'math_score',
                            'reading score': 'reading_score',
                            'writing score': 'writing_score'}, inplace=True)

In [73]:
exam_scores.columns     # inplace =  True will make the changes in the original df

Index(['gender', 'race', 'parental_education_level', 'lunch',
       'test_prep_course', 'math_score', 'reading_score', 'writing_score'],
      dtype='object')

In [74]:
sma_data['crime_rate'].sort_values(ascending=False)

20    85.62
74    82.68
53    80.94
4     80.19
67    78.10
      ...
8     30.51
72    28.52
76    25.49
38    23.64
70    23.32
Name: crime_rate, Length: 99, dtype: float64

In [75]:
sma_data.sort_values(by='crime_rate', ascending=False)

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
20,9155,53.8,11.1,2280,6450,60.1,575.2,7766,4,85.62
74,1412,39.2,11.3,436,1837,49.4,154.2,2098,4,82.68
53,5966,39.5,9.6,737,1907,52.7,246.6,3007,4,80.94
4,2480,31.5,10.5,8502,16751,66.1,1514.5,26573,4,80.19
67,8152,22.3,9.1,405,1254,51.7,165.6,2257,4,78.10
...,...,...,...,...,...,...,...,...,...,...
8,3049,19.5,12.1,4005,21149,53.4,967.5,15826,1,30.51
72,2658,39.0,12.2,365,5430,49.9,136.9,1862,1,28.52
76,862,26.3,13.4,423,1929,43.3,145.5,2010,1,25.49
38,1951,28.4,14.5,696,4843,47.9,271.5,3667,1,23.64
70,946,16.4,11.1,366,1455,43.9,163.8,2178,1,23.32

In [76]:
titanic_data = "https://raw.githubusercontent.com/dphi-official/Datasets/master/titanic_data.csv"

In [77]:
df = pd.read_csv(titanic_data)

In [78]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [81]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [82]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [87]:
age_mean_before = df['Age'].mean()

In [88]:
age_mean_before

29.69911764705882

In [90]:
df['Age'].fillna(age_mean_before, inplace=True)

In [91]:
df['Age'].mean()

29.69911764705882

In [97]:
df[df['Embarked'] =='S'][0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S

In [92]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [94]:
df[df['Embarked'].isnull()].index.tolist()

[61, 829]

In [98]:
df['Embarked'].fillna('S', inplace =True)

In [100]:
df['Embarked'].isnull().sum()

0

In [101]:
# Exercise 1
# Consider the following lists:

lst1 = [1, 2, 3, 5, 8]
lst2 = [8, 5, 3, 2, 1]

In [102]:
lst3 = lst1 +lst2
lst3

[1, 2, 3, 5, 8, 8, 5, 3, 2, 1]

In [103]:
s1 = pd.Series(lst1)
s2 = pd.Series(lst2)
s3 = s1 + s2

In [104]:
s3

0    9
1    7
2    6
3    7
4    9
dtype: int64

In [105]:
s1 - s2

0   -7
1   -3
2    0
3    3
4    7
dtype: int64

In [106]:
s1 * s2

0     8
1    10
2     9
3    10
4     8
dtype: int64

In [107]:
s1 / s2

0    0.125
1    0.400
2    1.000
3    2.500
4    8.000
dtype: float64